In [4]:
import pandas as pd

In [5]:
df = pd.read_csv("8-apply_function_data.csv")

In [6]:
df

    Employee_ID     Name Department  Salary  Experience  Performance_Score
0             1    Emp_1  Marketing   82251           6                  5
1             2    Emp_2      Sales   52662          24                  3
2             3    Emp_3    Finance   38392           5                  3
3             4    Emp_4      Sales   60535          20                  3
4             5    Emp_5      Sales  108603           2                  2
..          ...      ...        ...     ...         ...                ...
95           96   Emp_96    Finance   93734          19                  4
96           97   Emp_97      Sales  100467          22                  2
97           98   Emp_98         IT   82662          23                  3
98           99   Emp_99         IT   42688          22                  1
99          100  Emp_100         HR   55342          14                  3

[100 rows x 6 columns]

In [7]:
df.head()

   Employee_ID   Name Department  Salary  Experience  Performance_Score
0            1  Emp_1  Marketing   82251           6                  5
1            2  Emp_2      Sales   52662          24                  3
2            3  Emp_3    Finance   38392           5                  3
3            4  Emp_4      Sales   60535          20                  3
4            5  Emp_5      Sales  108603           2                  2

In [8]:
df.tail()

    Employee_ID     Name Department  Salary  Experience  Performance_Score
95           96   Emp_96    Finance   93734          19                  4
96           97   Emp_97      Sales  100467          22                  2
97           98   Emp_98         IT   82662          23                  3
98           99   Emp_99         IT   42688          22                  1
99          100  Emp_100         HR   55342          14                  3

In [9]:
df.describe()

       Employee_ID         Salary  Experience  Performance_Score
count   100.000000     100.000000  100.000000          100.00000
mean     50.500000   77508.090000   12.090000            3.03000
std      29.011492   26083.327596    7.543939            1.41746
min       1.000000   30206.000000    1.000000            1.00000
25%      25.750000   54347.500000    5.000000            2.00000
50%      50.500000   80932.000000   12.000000            3.00000
75%      75.250000   97620.500000   19.000000            4.00000
max     100.000000  119474.000000   24.000000            5.00000

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_ID        100 non-null    int64
 1   Name               100 non-null    object
 2   Department         100 non-null    object
 3   Salary             100 non-null    int64
 4   Experience         100 non-null    int64
 5   Performance_Score  100 non-null    int64
dtypes: int64(4), object(2)
memory usage: 4.8+ KB

In [11]:
df.columns

Index(['Employee_ID', 'Name', 'Department', 'Salary', 'Experience',
       'Performance_Score'],
      dtype='object')

In [12]:
df[1:20]

    Employee_ID    Name Department  Salary  Experience  Performance_Score
1             2   Emp_2      Sales   52662          24                  3
2             3   Emp_3    Finance   38392           5                  3
3             4   Emp_4      Sales   60535          20                  3
4             5   Emp_5      Sales  108603           2                  2
5             6   Emp_6         IT   82256           6                  5
6             7   Emp_7    Finance  119135          22                  1
7             8   Emp_8    Finance   65222          11                  4
8             9   Emp_9    Finance  107373          16                  1
9            10  Emp_10      Sales  109575          16                  5
10           11  Emp_11  Marketing  114651           1                  4
11           12  Emp_12    Finance   93335           9                  5
12           13  Emp_13      Sales   40965           6                  3
13           14  Emp_14         IT   54538          16                  4
14           15  Emp_15  Marketing  100592           3                  3
15           16  Emp_16         IT   38110          20                  1
16           17  Emp_17  Marketing  109309           4                  1
17           18  Emp_18      Sales   57266          19                  4
18           19  Emp_19         HR   82992           3                  4
19           20  Emp_20  Marketing  112948          19                  5

In [13]:
def salary_category(salary):
    if salary < 5000:
        return "Low"
    elif 5000 <= salary < 8000:
        return "Medium"
    else:
        return "High"

In [14]:
df["Salary_Category"] = df["Salary"].apply(salary_category)

In [15]:
df

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_Category
0,1,Emp_1,Marketing,82251,6,5,High
1,2,Emp_2,Sales,52662,24,3,High
2,3,Emp_3,Finance,38392,5,3,High
3,4,Emp_4,Sales,60535,20,3,High
4,5,Emp_5,Sales,108603,2,2,High
...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High
96,97,Emp_97,Sales,100467,22,2,High
97,98,Emp_98,IT,82662,23,3,High
98,99,Emp_99,IT,42688,22,1,High
99,100,Emp_100,HR,55342,14,3,High

In [16]:
def new_perf_score(row):
    if row["Experience"] > 10:
        return row["Performance_Score"] + 1
    else:
        return row["Performance_Score"]

In [17]:
df["new_perf_score"] = df.apply(new_perf_score , axis=1)

In [18]:
df

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_Category,new_perf_score
0,1,Emp_1,Marketing,82251,6,5,High,5
1,2,Emp_2,Sales,52662,24,3,High,4
2,3,Emp_3,Finance,38392,5,3,High,3
3,4,Emp_4,Sales,60535,20,3,High,4
4,5,Emp_5,Sales,108603,2,2,High,2
...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High,5
96,97,Emp_97,Sales,100467,22,2,High,3
97,98,Emp_98,IT,82662,23,3,High,4
98,99,Emp_99,IT,42688,22,1,High,2
99,100,Emp_100,HR,55342,14,3,High,4

In [19]:
df["Formatted_Name"] = df["Name"].apply(lambda x: x.replace("_", " "))

In [20]:
df

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_Category,new_perf_score,Formatted_Name
0,1,Emp_1,Marketing,82251,6,5,High,5,Emp 1
1,2,Emp_2,Sales,52662,24,3,High,4,Emp 2
2,3,Emp_3,Finance,38392,5,3,High,3,Emp 3
3,4,Emp_4,Sales,60535,20,3,High,4,Emp 4
4,5,Emp_5,Sales,108603,2,2,High,2,Emp 5
...,...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High,5,Emp 96
96,97,Emp_97,Sales,100467,22,2,High,3,Emp 97
97,98,Emp_98,IT,82662,23,3,High,4,Emp 98
98,99,Emp_99,IT,42688,22,1,High,2,Emp 99
99,100,Emp_100,HR,55342,14,3,High,4,Emp 100

In [22]:
df['Department'].value_counts()  # Hangi departmandan kaç kişi

Department
Marketing    26
IT           21
Sales        19
HR           18
Finance      16
Name: count, dtype: int64

In [23]:
# Satış departmanında 5 yıldan fazla deneyimi olanlar

sales_senior = df[ (df['Department'] == 'Sales')  &  (df['Experience'] > 5) ]

In [24]:
sales_senior

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_Category,new_perf_score,Formatted_Name
1,2,Emp_2,Sales,52662,24,3,High,4,Emp 2
3,4,Emp_4,Sales,60535,20,3,High,4,Emp 4
9,10,Emp_10,Sales,109575,16,5,High,6,Emp 10
12,13,Emp_13,Sales,40965,6,3,High,3,Emp 13
17,18,Emp_18,Sales,57266,19,4,High,5,Emp 18
21,22,Emp_22,Sales,30206,7,3,High,3,Emp 22
35,36,Emp_36,Sales,85820,7,3,High,3,Emp 36
37,38,Emp_38,Sales,111734,16,1,High,2,Emp 38
47,48,Emp_48,Sales,78925,9,1,High,1,Emp 48
62,63,Emp_63,Sales,39474,17,5,High,6,Emp 63
71,72,Emp_72,Sales,91087,18,1,High,2,Emp 72
72,73,Emp_73,Sales,98840,14,2,High,3,Emp 73
83,84,Emp_84,Sales,97172,14,5,High,6,Emp 84
96,97,Emp_97,Sales,100467,22,2,High,3,Emp 97

In [27]:
# Performans skoru 4 ve 5 olanlar (yüksek performans)

perf_skor = df[df['Experience'] >= 5]

In [28]:
perf_skor

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_Category,new_perf_score,Formatted_Name
0,1,Emp_1,Marketing,82251,6,5,High,5,Emp 1
1,2,Emp_2,Sales,52662,24,3,High,4,Emp 2
2,3,Emp_3,Finance,38392,5,3,High,3,Emp 3
3,4,Emp_4,Sales,60535,20,3,High,4,Emp 4
5,6,Emp_6,IT,82256,6,5,High,5,Emp 6
...,...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High,5,Emp 96
96,97,Emp_97,Sales,100467,22,2,High,3,Emp 97
97,98,Emp_98,IT,82662,23,3,High,4,Emp 98
98,99,Emp_99,IT,42688,22,1,High,2,Emp 99
99,100,Emp_100,HR,55342,14,3,High,4,Emp 100

In [35]:
def experience_level(years):
    if years < 3:
        return "Junior"
    elif years < 7:
        return "mid"
    else:
        return "Senior"

In [36]:
df['Experience_Level'] = df['Experience'].apply(experience_level)

In [37]:
df

,Employee_ID,Name,Department,Salary,Experience,Performance_Score,Salary_Category,new_perf_score,Formatted_Name,Experience_Level
0,1,Emp_1,Marketing,82251,6,5,High,5,Emp 1,mid
1,2,Emp_2,Sales,52662,24,3,High,4,Emp 2,Senior
2,3,Emp_3,Finance,38392,5,3,High,3,Emp 3,mid
3,4,Emp_4,Sales,60535,20,3,High,4,Emp 4,Senior
4,5,Emp_5,Sales,108603,2,2,High,2,Emp 5,Junior
...,...,...,...,...,...,...,...,...,...,...
95,96,Emp_96,Finance,93734,19,4,High,5,Emp 96,Senior
96,97,Emp_97,Sales,100467,22,2,High,3,Emp 97,Senior
97,98,Emp_98,IT,82662,23,3,High,4,Emp 98,Senior
98,99,Emp_99,IT,42688,22,1,High,2,Emp 99,Senior
99,100,Emp_100,HR,55342,14,3,High,4,Emp 100,Senior

In [38]:
dept_summary = df.groupby('Department')[['Salary', 'Experience', 'Performance_Score']].mean()

In [40]:
dept_summary

                  Salary  Experience  Performance_Score
Department
Finance     81011.812500   10.875000           3.062500
HR          87695.333333   11.500000           3.166667
IT          60994.190476   16.142857           2.904762
Marketing   82930.807692   10.423077           3.230769
Sales       75738.157895   11.473684           2.736842

In [41]:
dept_summary

                  Salary  Experience  Performance_Score
Department
Finance     81011.812500   10.875000           3.062500
HR          87695.333333   11.500000           3.166667
IT          60994.190476   16.142857           2.904762
Marketing   82930.807692   10.423077           3.230769
Sales       75738.157895   11.473684           2.736842